# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [1]:
import pandas as pd
import numpy as np

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [4]:
employee = pd.read_csv("./data/Employee.csv")
employee.head(10)

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [6]:
employee.groupby(['Department']).agg({'Salary': np.mean}).reset_index().head()

  Department  Salary
0         HR   45.00
1         IT   48.75
2      Sales   55.00

In [10]:
employee.pivot_table(index= ['Department'],  values = ['Salary']).reset_index()

  Department  Salary
0         HR   45.00
1         IT   48.75
2      Sales   55.00

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [11]:
employee.pivot_table(index= ['Department','Title'], values = ['Salary']).reset_index()

  Department      Title  Salary
0         HR         VP    70.0
1         HR    analyst    32.5
2         IT         VP    70.0
3         IT    analyst    32.5
4         IT  associate    60.0
5      Sales  associate    55.0

In [ ]:
# your answer here

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [23]:
employee.pivot_table(index= ['Title'], values = ['Salary', 'Years']).reset_index()

       Title     Salary  Years
0         VP  70.000000   8.00
1    analyst  32.500000   2.25
2  associate  56.666667   4.00

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [19]:
df = employee.pivot_table(index= ['Department'], values = ['Salary','Name'], aggfunc = {'Salary': np.mean,'Name': 'count'}).reset_index()
df.columns = ['Department', 'No_Employees', 'Avg_Salary']
df

  Department  No_Employees  Avg_Salary
0         HR             3       45.00
1         IT             4       48.75
2      Sales             2       55.00

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [21]:
df = employee.pivot_table(index= ['Department', 'Title'], values = ['Salary'], aggfunc = {'Salary': [np.mean, np.min, np.max, np.std]}).reset_index()
df.columns = ['Department', 'Title', 'Avg_Salary', 'Min_Salary', 'Max Salary', 'St_Deviation']
df

  Department      Title  Avg_Salary  Min_Salary  Max Salary  St_Deviation
0         HR         VP          70          70        70.0           NaN
1         HR    analyst          35          30        32.5      3.535534
2         IT         VP          70          70        70.0           NaN
3         IT    analyst          35          30        32.5      3.535534
4         IT  associate          60          60        60.0           NaN
5      Sales  associate          55          55        55.0      0.000000

#### Based on your comments, fill the missing values with an appropriate value.

In [22]:
df. fillna(0)

  Department      Title  Avg_Salary  Min_Salary  Max Salary  St_Deviation
0         HR         VP          70          70        70.0      0.000000
1         HR    analyst          35          30        32.5      3.535534
2         IT         VP          70          70        70.0      0.000000
3         IT    analyst          35          30        32.5      3.535534
4         IT  associate          60          60        60.0      0.000000
5      Sales  associate          55          55        55.0      0.000000

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [24]:
df3 = employee.pivot_table(index= ['Department'], values = ['Name', 'Salary'], aggfunc = {'Name': 'count', 'Salary' : sum}).reset_index()
df3.columns = ['Department', 'No_Employees', 'Total_Salary']
df3

  Department  No_Employees  Total_Salary
0         HR             3           135
1         IT             4           195
2      Sales             2           110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [26]:
df4 = employee.pivot_table(index= ['Department', 'Title'], values = ['Years', 'Salary'], aggfunc = {'Years': sum, 'Salary' : 'mean'}).reset_index()
df4.columns = ['Department', 'Title', 'Total_Experience', 'Avg_Salary']
df4

  Department      Title  Total_Experience  Avg_Salary
0         HR         VP              70.0           8
1         HR    analyst              32.5           6
2         IT         VP              70.0           8
3         IT    analyst              32.5           3
4         IT  associate              60.0           7
5      Sales  associate              55.0           5

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [29]:
def remove_max_avg(x):
    return (sum(x)-max(x))/(len(x)-1)

In [30]:
df5 = employee.pivot_table(index= ['Department'], values = ['Salary'], aggfunc = {'Salary': remove_max_avg}).reset_index()
df5.columns = ['Department','AvgSalary-Max']
df5

  Department  AvgSalary-Max
0         HR             65
1         IT            125
2      Sales             55